package str;

/**
 * 字符串分割
 * 
 * @author y
 *
 */
public class TestSplit {
	public static void main(String[] args) {
		String song = "爱太深容易看见伤痕,\n" + "情太真所以难舍难分,\n" + "折一千对纸鹤,\n" + "结一千颗心情,\n" + "传说中心与心能相逢,\n" + "夜难眠往事忽隐忽现,\n"
				+ "心在痛对你越陷越深,\n" + "折一千对纸鹤,\n" + "解一千个心愿,\n" + "梦醒后情缘不再飘零,\n" + "我的心不后悔,\n" + "折折叠叠都是为了你,\n"
				+ "我的泪流不尽,\n" + "纠缠在梦里夜里的负累,\n" + "我的心不后悔,\n" + "反反复复也是为了你,\n" + "邰正宵,\n" + "邰正宵,\n" + "千纸鹤千颗心在风里飞,\n"
				+ "夜难眠往事忽隐忽现,\n" + "心在痛对你越陷越深,\n" + "折一千对纸鹤,\n" + "解一千个心愿,\n" + "梦醒后情缘不再飘零,\n" + "我的心不后悔,\n"
				+ "折折叠叠都是为了你,\n" + "我的泪流不尽,\n" + "纠缠在梦里夜里的负累,\n" + "我的心不后悔,\n" + "反反复复也是为了你,\n" + "千纸鹤千颗心在风里飞,\n"
				+ "我的心不后悔,\n" + "折折叠叠都是为了你,\n" + "我的泪流不尽,\n" + "纠缠在梦里夜里的负累,\n" + "我的心不后悔,\n" + "反反复复也是为了你,\n"
				+ "千纸鹤千颗心在风里飞,\n" + "千纸鹤千份情在风里飞";
		String[] songs = song.split(" ");
		for (String s : songs) {
			System.out.println(s);
		}
	}
}
